contrib-other/camelse/examples/c2db/C2DBCompositeApp/test/UpdateTestCase/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:per="http://j2ee.netbeans.org/xsd/tableSchema/db/sample/person">
  <soapenv:Body>
    <per:PERSON>
      <!--1 or more repetitions:-->
      <per:PERSON_Record>
        <per:STATE>CA</per:STATE>
        <per:LAST_NAME>bar</per:LAST_NAME>
        <per:SSN>111-222-3333</per:SSN>
        <per:ZIPCODE>95054</per:ZIPCODE>
        <per:FIRST_NAME>foo</per:FIRST_NAME>
        <per:CITY>San Jose</per:CITY>
        <per:STREET>Sun Fire</per:STREET>
      </per:PERSON_Record>
    </per:PERSON>
  </soapenv:Body>
</soapenv:Envelope>