contrib-other/camelse/examples/c2db/C2DBCompositeApp/test/VerifyInsertTestCase/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <PERSON xmlns:msgns="http://j2ee.netbeans.org/wsdl/db/sample/person" xmlns="http://j2ee.netbeans.org/xsd/tableSchema/db/sample/person">
      <PERSON_Record>
        <STATE>CA</STATE>
        <LAST_NAME>bar</LAST_NAME>
        <SSN>111-222-3333</SSN>
        <ZIPCODE>95054</ZIPCODE>
        <FIRST_NAME>foo</FIRST_NAME>
        <CITY>Santa Clara</CITY>
        <STREET>Network Circle</STREET>
      </PERSON_Record>
    </PERSON>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
